pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSpu_reg.h
/** \brief 74, Antenna Offset */
#define SPU0_BE0_ANTOFST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA800074u)
/** Alias (User Manual Name) for SPU0_BE0_ANTOFST3.
* To use register names with standard convension, please use SPU0_BE0_ANTOFST3.
*/
#define SPU0_BE0_A3_ANTOFST (SPU0_BE0_ANTOFST3)

/** \brief 78, Unloader Configuration */
#define SPU0_BE0_UNLDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFA800078u)

/** \brief 7C, Unloader Configuration 2 */
#define SPU0_BE0_UNLDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFA80007Cu)

/** \brief 80, Spare Configuration Register */
#define SPU0_BE0_UNLDR_ACFG /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_ACFG*)0xFA800080u)

/** \brief 84, Output Data Processor Configuration */
#define SPU0_BE0_ODP_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFA800084u)

/** \brief 88, NCI Control */
#define SPU0_BE0_NCICTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFA800088u)

/** \brief 8C, Summation Unit Control */
#define SPU0_BE0_SUMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFA80008Cu)

/** \brief 90, Power Summation */
#define SPU0_BE0_PWRSUM /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFA800090u)

/** \brief 94, Power Information Channel Control */
#define SPU0_BE0_PWRCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFA800094u)

/** \brief 98, CFAR Module Control */
#define SPU0_BE0_CFARCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFA800098u)

/** \brief 9C, Sideband Control */
#define SPU0_BE0_SBCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFA80009Cu)

/** \brief A0, Loader Configuration */
#define SPU0_BE1_LDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF*)0xFA8000A0u)

/** \brief A4, Loader Configuration Extended */
#define SPU0_BE1_LDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_LDR_CONF2*)0xFA8000A4u)

/** \brief A8, Antenna Offset */
#define SPU0_BE1_ANTOFST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000A8u)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST0.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST0.
*/
#define SPU0_BE1_A0_ANTOFST (SPU0_BE1_ANTOFST0)

/** \brief AC, Antenna Offset */
#define SPU0_BE1_ANTOFST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000ACu)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST1.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST1.
*/
#define SPU0_BE1_A1_ANTOFST (SPU0_BE1_ANTOFST1)

/** \brief B0, Antenna Offset */
#define SPU0_BE1_ANTOFST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000B0u)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST2.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST2.
*/
#define SPU0_BE1_A2_ANTOFST (SPU0_BE1_ANTOFST2)

/** \brief B4, Antenna Offset */
#define SPU0_BE1_ANTOFST3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ANTOFST*)0xFA8000B4u)
/** Alias (User Manual Name) for SPU0_BE1_ANTOFST3.
* To use register names with standard convension, please use SPU0_BE1_ANTOFST3.
*/
#define SPU0_BE1_A3_ANTOFST (SPU0_BE1_ANTOFST3)

/** \brief B8, Unloader Configuration */
#define SPU0_BE1_UNLDR_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF*)0xFA8000B8u)

/** \brief BC, Unloader Configuration 2 */
#define SPU0_BE1_UNLDR_CONF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_CONF2*)0xFA8000BCu)

/** \brief C0, Spare Configuration Register */
#define SPU0_BE1_UNLDR_ACFG /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_UNLDR_ACFG*)0xFA8000C0u)

/** \brief C4, Output Data Processor Configuration */
#define SPU0_BE1_ODP_CONF /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_ODP_CONF*)0xFA8000C4u)

/** \brief C8, NCI Control */
#define SPU0_BE1_NCICTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_NCICTRL*)0xFA8000C8u)

/** \brief CC, Summation Unit Control */
#define SPU0_BE1_SUMCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SUMCTRL*)0xFA8000CCu)

/** \brief D0, Power Summation */
#define SPU0_BE1_PWRSUM /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRSUM*)0xFA8000D0u)

/** \brief D4, Power Information Channel Control */
#define SPU0_BE1_PWRCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_PWRCTRL*)0xFA8000D4u)

/** \brief D8, CFAR Module Control */
#define SPU0_BE1_CFARCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_CFARCTRL*)0xFA8000D8u)

/** \brief DC, Sideband Control */
#define SPU0_BE1_SBCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BE_SBCTRL*)0xFA8000DCu)

/** \brief E0, Bin Rejection Mask */
#define SPU0_BIN_REJ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ0.
* To use register names with standard convension, please use SPU0_BIN_REJ0.
*/
#define SPU0_BIN0_REJ (SPU0_BIN_REJ0)

/** \brief E4, Bin Rejection Mask */
#define SPU0_BIN_REJ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ1.
* To use register names with standard convension, please use SPU0_BIN_REJ1.
*/
#define SPU0_BIN1_REJ (SPU0_BIN_REJ1)

/** \brief E8, Bin Rejection Mask */
#define SPU0_BIN_REJ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000E8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ2.
* To use register names with standard convension, please use SPU0_BIN_REJ2.
*/
#define SPU0_BIN2_REJ (SPU0_BIN_REJ2)

/** \brief EC, Bin Rejection Mask */
#define SPU0_BIN_REJ3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000ECu)
/** Alias (User Manual Name) for SPU0_BIN_REJ3.
* To use register names with standard convension, please use SPU0_BIN_REJ3.
*/
#define SPU0_BIN3_REJ (SPU0_BIN_REJ3)

/** \brief F0, Bin Rejection Mask */
#define SPU0_BIN_REJ4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ4.
* To use register names with standard convension, please use SPU0_BIN_REJ4.
*/
#define SPU0_BIN4_REJ (SPU0_BIN_REJ4)

/** \brief F4, Bin Rejection Mask */
#define SPU0_BIN_REJ5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8000F4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ5.
* To use register names with standard convension, please use SPU0_BIN_REJ5.
*/
#define SPU0_BIN5_REJ (SPU0_BIN_REJ5)

