pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSpu_reg.h
/** \brief 224, Bin Rejection Unit Tracking */
#define SPU0_MD0_BINCOUNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_BINCOUNT*)0xFA800224u)

/** \brief 228, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800228u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT0.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT0.
*/
#define SPU0_MD0_MASK0_ACCEPT (SPU0_MD0_MASK_ACCEPT0)

/** \brief 22C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80022Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT1.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT1.
*/
#define SPU0_MD0_MASK1_ACCEPT (SPU0_MD0_MASK_ACCEPT1)

/** \brief 230, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800230u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT2.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT2.
*/
#define SPU0_MD0_MASK2_ACCEPT (SPU0_MD0_MASK_ACCEPT2)

/** \brief 234, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800234u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT3.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT3.
*/
#define SPU0_MD0_MASK3_ACCEPT (SPU0_MD0_MASK_ACCEPT3)

/** \brief 238, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800238u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT4.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT4.
*/
#define SPU0_MD0_MASK4_ACCEPT (SPU0_MD0_MASK_ACCEPT4)

/** \brief 23C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80023Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT5.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT5.
*/
#define SPU0_MD0_MASK5_ACCEPT (SPU0_MD0_MASK_ACCEPT5)

/** \brief 240, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800240u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT6.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT6.
*/
#define SPU0_MD0_MASK6_ACCEPT (SPU0_MD0_MASK_ACCEPT6)

/** \brief 244, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800244u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT7.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT7.
*/
#define SPU0_MD0_MASK7_ACCEPT (SPU0_MD0_MASK_ACCEPT7)

/** \brief 248, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800248u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT8.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT8.
*/
#define SPU0_MD0_MASK8_ACCEPT (SPU0_MD0_MASK_ACCEPT8)

/** \brief 24C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80024Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT9.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT9.
*/
#define SPU0_MD0_MASK9_ACCEPT (SPU0_MD0_MASK_ACCEPT9)

/** \brief 250, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800250u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT10.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT10.
*/
#define SPU0_MD0_MASK10_ACCEPT (SPU0_MD0_MASK_ACCEPT10)

/** \brief 254, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800254u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT11.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT11.
*/
#define SPU0_MD0_MASK11_ACCEPT (SPU0_MD0_MASK_ACCEPT11)

/** \brief 258, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800258u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT12.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT12.
*/
#define SPU0_MD0_MASK12_ACCEPT (SPU0_MD0_MASK_ACCEPT12)

/** \brief 25C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80025Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT13.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT13.
*/
#define SPU0_MD0_MASK13_ACCEPT (SPU0_MD0_MASK_ACCEPT13)

/** \brief 260, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800260u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT14.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT14.
*/
#define SPU0_MD0_MASK14_ACCEPT (SPU0_MD0_MASK_ACCEPT14)

/** \brief 264, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800264u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT15.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT15.
*/
#define SPU0_MD0_MASK15_ACCEPT (SPU0_MD0_MASK_ACCEPT15)

/** \brief 268, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800268u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT16.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT16.
*/
#define SPU0_MD0_MASK16_ACCEPT (SPU0_MD0_MASK_ACCEPT16)

/** \brief 26C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80026Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT17.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT17.
*/
#define SPU0_MD0_MASK17_ACCEPT (SPU0_MD0_MASK_ACCEPT17)

