pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSpu_reg.h
/** \brief 270, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800270u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT18.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT18.
*/
#define SPU0_MD0_MASK18_ACCEPT (SPU0_MD0_MASK_ACCEPT18)

/** \brief 274, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800274u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT19.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT19.
*/
#define SPU0_MD0_MASK19_ACCEPT (SPU0_MD0_MASK_ACCEPT19)

/** \brief 278, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800278u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT20.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT20.
*/
#define SPU0_MD0_MASK20_ACCEPT (SPU0_MD0_MASK_ACCEPT20)

/** \brief 27C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80027Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT21.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT21.
*/
#define SPU0_MD0_MASK21_ACCEPT (SPU0_MD0_MASK_ACCEPT21)

/** \brief 280, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800280u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT22.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT22.
*/
#define SPU0_MD0_MASK22_ACCEPT (SPU0_MD0_MASK_ACCEPT22)

/** \brief 284, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800284u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT23.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT23.
*/
#define SPU0_MD0_MASK23_ACCEPT (SPU0_MD0_MASK_ACCEPT23)

/** \brief 288, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800288u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT24.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT24.
*/
#define SPU0_MD0_MASK24_ACCEPT (SPU0_MD0_MASK_ACCEPT24)

/** \brief 28C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80028Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT25.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT25.
*/
#define SPU0_MD0_MASK25_ACCEPT (SPU0_MD0_MASK_ACCEPT25)

/** \brief 290, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800290u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT26.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT26.
*/
#define SPU0_MD0_MASK26_ACCEPT (SPU0_MD0_MASK_ACCEPT26)

/** \brief 294, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT27 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800294u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT27.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT27.
*/
#define SPU0_MD0_MASK27_ACCEPT (SPU0_MD0_MASK_ACCEPT27)

/** \brief 298, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT28 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA800298u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT28.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT28.
*/
#define SPU0_MD0_MASK28_ACCEPT (SPU0_MD0_MASK_ACCEPT28)

/** \brief 29C, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT29 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA80029Cu)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT29.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT29.
*/
#define SPU0_MD0_MASK29_ACCEPT (SPU0_MD0_MASK_ACCEPT29)

/** \brief 2A0, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT30 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002A0u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT30.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT30.
*/
#define SPU0_MD0_MASK30_ACCEPT (SPU0_MD0_MASK_ACCEPT30)

/** \brief 2A4, Bin Acceptance  Mask */
#define SPU0_MD0_MASK_ACCEPT31 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002A4u)
/** Alias (User Manual Name) for SPU0_MD0_MASK_ACCEPT31.
* To use register names with standard convension, please use SPU0_MD0_MASK_ACCEPT31.
*/
#define SPU0_MD0_MASK31_ACCEPT (SPU0_MD0_MASK_ACCEPT31)

/** \brief 2A8, Dataset Metadata */
#define SPU0_MD1_METADATA /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_METADATA*)0xFA8002A8u)

/** \brief 2AC, Bin Rejection Unit Tracking */
#define SPU0_MD1_BINCOUNT /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_BINCOUNT*)0xFA8002ACu)

/** \brief 2B0, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002B0u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT0.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT0.
*/
#define SPU0_MD1_MASK0_ACCEPT (SPU0_MD1_MASK_ACCEPT0)

/** \brief 2B4, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002B4u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT1.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT1.
*/
#define SPU0_MD1_MASK1_ACCEPT (SPU0_MD1_MASK_ACCEPT1)

/** \brief 2B8, Bin Acceptance  Mask */
#define SPU0_MD1_MASK_ACCEPT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFA8002B8u)
/** Alias (User Manual Name) for SPU0_MD1_MASK_ACCEPT2.
* To use register names with standard convension, please use SPU0_MD1_MASK_ACCEPT2.
*/
#define SPU0_MD1_MASK2_ACCEPT (SPU0_MD1_MASK_ACCEPT2)

