pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxSpu_reg.h
/** \brief 398, Monitor CRC Register */
#define SPU0_CRC_DATA4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA800398u)
/** Alias (User Manual Name) for SPU0_CRC_DATA4.
* To use register names with standard convension, please use SPU0_CRC_DATA4.
*/
#define SPU0_DATA4_CRC (SPU0_CRC_DATA4)

/** \brief 39C, Monitor CRC Register */
#define SPU0_CRC_DATA5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA80039Cu)
/** Alias (User Manual Name) for SPU0_CRC_DATA5.
* To use register names with standard convension, please use SPU0_CRC_DATA5.
*/
#define SPU0_DATA5_CRC (SPU0_CRC_DATA5)

/** \brief 3A0, Monitor CRC Register */
#define SPU0_CRC_DATA6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003A0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA6.
* To use register names with standard convension, please use SPU0_CRC_DATA6.
*/
#define SPU0_DATA6_CRC (SPU0_CRC_DATA6)

/** \brief 3A4, Monitor CRC Register */
#define SPU0_CRC_DATA7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003A4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA7.
* To use register names with standard convension, please use SPU0_CRC_DATA7.
*/
#define SPU0_DATA7_CRC (SPU0_CRC_DATA7)

/** \brief 3A8, Monitor CRC Register */
#define SPU0_CRC_DATA8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003A8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA8.
* To use register names with standard convension, please use SPU0_CRC_DATA8.
*/
#define SPU0_DATA8_CRC (SPU0_CRC_DATA8)

/** \brief 3AC, Monitor CRC Register */
#define SPU0_CRC_DATA9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003ACu)
/** Alias (User Manual Name) for SPU0_CRC_DATA9.
* To use register names with standard convension, please use SPU0_CRC_DATA9.
*/
#define SPU0_DATA9_CRC (SPU0_CRC_DATA9)

/** \brief 3B0, Monitor CRC Register */
#define SPU0_CRC_DATA10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003B0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA10.
* To use register names with standard convension, please use SPU0_CRC_DATA10.
*/
#define SPU0_DATA10_CRC (SPU0_CRC_DATA10)

/** \brief 3B4, Monitor CRC Register */
#define SPU0_CRC_DATA11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003B4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA11.
* To use register names with standard convension, please use SPU0_CRC_DATA11.
*/
#define SPU0_DATA11_CRC (SPU0_CRC_DATA11)

/** \brief 3B8, Monitor CRC Register */
#define SPU0_CRC_DATA12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003B8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA12.
* To use register names with standard convension, please use SPU0_CRC_DATA12.
*/
#define SPU0_DATA12_CRC (SPU0_CRC_DATA12)

/** \brief 3BC, Monitor CRC Register */
#define SPU0_CRC_DATA13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003BCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA13.
* To use register names with standard convension, please use SPU0_CRC_DATA13.
*/
#define SPU0_DATA13_CRC (SPU0_CRC_DATA13)

/** \brief 3C0, Monitor CRC Register */
#define SPU0_CRC_DATA14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003C0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA14.
* To use register names with standard convension, please use SPU0_CRC_DATA14.
*/
#define SPU0_DATA14_CRC (SPU0_CRC_DATA14)

/** \brief 3C4, Monitor CRC Register */
#define SPU0_CRC_DATA15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003C4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA15.
* To use register names with standard convension, please use SPU0_CRC_DATA15.
*/
#define SPU0_DATA15_CRC (SPU0_CRC_DATA15)

/** \brief 3C8, Monitor CRC Register */
#define SPU0_CRC_DATA16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003C8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA16.
* To use register names with standard convension, please use SPU0_CRC_DATA16.
*/
#define SPU0_DATA16_CRC (SPU0_CRC_DATA16)

/** \brief 3CC, Monitor CRC Register */
#define SPU0_CRC_DATA17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003CCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA17.
* To use register names with standard convension, please use SPU0_CRC_DATA17.
*/
#define SPU0_DATA17_CRC (SPU0_CRC_DATA17)

/** \brief 3D0, Monitor CRC Register */
#define SPU0_CRC_DATA18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003D0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA18.
* To use register names with standard convension, please use SPU0_CRC_DATA18.
*/
#define SPU0_DATA18_CRC (SPU0_CRC_DATA18)

/** \brief 3D4, Monitor CRC Register */
#define SPU0_CRC_DATA19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003D4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA19.
* To use register names with standard convension, please use SPU0_CRC_DATA19.
*/
#define SPU0_DATA19_CRC (SPU0_CRC_DATA19)

/** \brief 3D8, Monitor CRC Register */
#define SPU0_CRC_DATA20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003D8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA20.
* To use register names with standard convension, please use SPU0_CRC_DATA20.
*/
#define SPU0_DATA20_CRC (SPU0_CRC_DATA20)

/** \brief 3DC, Monitor CRC Register */
#define SPU0_CRC_DATA21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003DCu)
/** Alias (User Manual Name) for SPU0_CRC_DATA21.
* To use register names with standard convension, please use SPU0_CRC_DATA21.
*/
#define SPU0_DATA21_CRC (SPU0_CRC_DATA21)

/** \brief 3E0, Monitor CRC Register */
#define SPU0_CRC_DATA22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003E0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA22.
* To use register names with standard convension, please use SPU0_CRC_DATA22.
*/
#define SPU0_DATA22_CRC (SPU0_CRC_DATA22)

/** \brief 3E4, Monitor CRC Register */
#define SPU0_CRC_DATA23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003E4u)
/** Alias (User Manual Name) for SPU0_CRC_DATA23.
* To use register names with standard convension, please use SPU0_CRC_DATA23.
*/
#define SPU0_DATA23_CRC (SPU0_CRC_DATA23)

/** \brief 3E8, Monitor CRC Register */
#define SPU0_CRC_DATA24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003E8u)
/** Alias (User Manual Name) for SPU0_CRC_DATA24.
* To use register names with standard convension, please use SPU0_CRC_DATA24.
*/
#define SPU0_DATA24_CRC (SPU0_CRC_DATA24)

/** \brief 3EC, Monitor CRC Register */
#define SPU0_CRC_DATA25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003ECu)
/** Alias (User Manual Name) for SPU0_CRC_DATA25.
* To use register names with standard convension, please use SPU0_CRC_DATA25.
*/
#define SPU0_DATA25_CRC (SPU0_CRC_DATA25)

/** \brief 3F0, Monitor CRC Register */
#define SPU0_CRC_DATA26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_DATA*)0xFA8003F0u)
/** Alias (User Manual Name) for SPU0_CRC_DATA26.
* To use register names with standard convension, please use SPU0_CRC_DATA26.
*/
#define SPU0_DATA26_CRC (SPU0_CRC_DATA26)

